app/controllers/administrateurs_controller.rb

  def index
    @administrateurs = Administrateur.all
---
SELECT "administrateurs".* FROM "administrateurs"

  def create
    @administrateur = Administrateur.new(administrateur_params)

    respond_to do |format|
      if @administrateur.save
---
INSERT INTO "administrateurs" ("pseudo", "password", "mail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["pseudo", "Ruby"], ["password", "ruby"], ["mail", "Baptiste.cazaubon@gmail.com"], ["created_at", "2015-05-13 13:57:53.731979"], ["updated_at", "2015-05-13 13:57:53.731979"]]

    def set_administrateur
      @administrateur = Administrateur.find(params[:id])
---
SELECT  "administrateurs".* FROM "administrateurs" WHERE "administrateurs"."id" = ? LIMIT 1  [["id", 1]]