app/controllers/utilisateurs_controller.rb

  def index
    @utilisateurs = Utilisateur.all
---
SELECT "utilisateurs".* FROM "utilisateurs"

  def create
    @utilisateur = Utilisateur.new(utilisateur_params)

    respond_to do |format|
      if @utilisateur.save
---
INSERT INTO "utilisateurs" ("pseudo", "password", "mail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["pseudo", "Baptiste"], ["password", "ruby"], ["mail", "Baptiste.cazaubon@gmail.com"], ["created_at", "2015-05-13 13:58:35.350185"], ["updated_at", "2015-05-13 13:58:35.350185"]]

  def update
    respond_to do |format|
      if @utilisateur.update(utilisateur_params)
---
UPDATE "utilisateurs" SET "mail" = ?, "updated_at" = ? WHERE "utilisateurs"."id" = ?  [["mail", "Baptiste.cazaubon@y-nov.com"], ["updated_at", "2015-05-13 13:59:15.057409"], ["id", 1]]

    def set_utilisateur
      @utilisateur = Utilisateur.find(params[:id])
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT 1  [["id", 1]]